Repository: arifayduran/arifayduran_dev
Catalog: assets/lib/l10n/app_*.arb
Languages: de

# appDescription
source: Portfolio of Arif Ayduran, Software Developer
de: Portfolio von Arif Ayduran, Softwareentwickler

# greeting
source: Hello!
de: Hallo!

# fullGreeting
source: Welcome to Portfolio of Arif Ayduran
de: Willkommen zum Portfolio von Arif Ayduran

# specialization
source: Software Developer
de: Software Entwickler

# switchModeMessageToLight
source: Color scheme switched to Light Mode
de: Farbschema auf den Light Modus geändert

# switchModeMessageToDark
source: Color scheme switched to Dark Mode
de: Farbschema auf den Dark Modus geändert

source: Dark Mode
de: Dark Modus

source: Light Mode
de: Light Modus

# scrolldownText
source: Scroll Down
de: Nach unten scrollen

# scrollupText
source: Scroll Up
de: Nach oben scrollen
