Repository: arifayduran/arifayduran_dev
Catalog: lib/l10n/app_*.arb
Languages: ar, tr

# appDescription
source: Portfolio of Arif Ayduran, Software Developer
ar: محفظة عارف أيدوران، مطور برمجيات
tr: Arif Ayduran'ın Portföyü, Yazılım Geliştirici

# greeting
source: Hello!
ar: مرحبًا!
tr: Merhaba!

# fullGreeting
source: Welcome to Portfolio of Arif Ayduran
ar: مرحبًا بكم في محفظة عارف أيدوران
tr: Arif Ayduran'ın Portföyüne Hoş Geldiniz

# specialization
source: Software Developer
ar: مطور برمجيات
tr: Yazılım Geliştiricisi

# toggleHoverToLight
source: Switch color sheme to Light Mode
ar: تغيير نظام الألوان إلى الوضع الفاتح
tr: Renk şemasını Açık Moda değiştir

# toggleHoverToDark
source: Switch color sheme to Dark Mode
ar: تغيير نظام الألوان إلى الوضع الداكن
tr: Renk şemasını Koyu Moda değiştir

# switchModeMessageToLight
source: Color scheme switched to Light Mode
ar: تم تغيير نظام الألوان إلى الوضع الفاتح
tr: Renk şeması Açık Moda değiştirildi

# switchModeMessageToDark
source: Color scheme switched to Dark Mode
ar: تم تغيير نظام الألوان إلى الوضع الداكن
tr: Renk şeması Koyu Moda değiştirildi

source: Dark Mode
ar: الوضع الداكن
tr: Koyu Mod

source: Light Mode
ar: الوضع الفاتح
tr: Açık Mod

# scrolldownText
source: Scroll Down
ar: التمرير للأسفل
tr: Aşağı Kaydır

# scrollupText
source: Scroll Up
ar: التمرير للأعلى
tr: Yukarı Kaydır

# langSelectHover
source: Change Language Settings
ar: تغيير إعدادات اللغة
tr: Dil Ayarlarını Değiştir

# systemLang
source: System Language
ar: لغة النظام
tr: Sistem Dili

# switchLanguageMessage
source: You have switched the language to English.
ar: لقد قمت بتغيير اللغة إلى العربية.
tr: Dil ayarı Türkçe olarak güncellendi.

# langCopiedFromSettingsMessage
source: Display language has been set from your language settings.
ar: تم تعيين لغة العرض من إعدادات اللغة الخاصة بك.
tr: Görüntü dili, dil ayarlarınızdan alındı.

# languageSettingsCopiedFromLastTimeMessage
source: Your language settings have been copied from last time.
ar: تم نسخ إعدادات اللغة الخاصة بك من آخر مرة.
tr: Dil ayarlarınız son seferden alındı.

# onHoverSystemLang
source: The system language is used to handle data, currency formats, and other locale settings.
ar: تُستخدم لغة النظام لمعالجة البيانات وتنسيقات العملات والإعدادات المحلية الأخرى.
tr: Sistem dili, veri, para birimi formatı ve diğer yerel ayarları işlemek için kullanılır.

# lastRouteMessage
source: The last route session has been successfully restored.
ar: تمت استعادة جلسة الطريق الأخيرة بنجاح.
tr: Son rota oturumu başarıyla geri yüklendi.
